DataFrame:
As in Python there are different type of data structure such as list, tuple,set,dictionary<br>
In Pandas: there are mainly two type of data structure:<br>
Series: Is it 1-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). It comes along with the index which is also called as axis. Series contains homogenous data, meaning all the data inside that 1-d array would be off same type.

DataFrame: It consists of one or many Series object collectively. So data would be heterogenous in nature, as many Series would comprise of different dtype.

In [141]:
#Initialize The DataFrame

import pandas as pd

#Data given to the dataframe can be of any form

print('Data passed as dictionary')
dict_df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})
print(dict_df)

print('='*40)

print('Data pass as list')
dict_lst = pd.DataFrame([1,2,3,4])
print(dict_lst)

print('='*40)

print('Data passed as list of list')
dict_llst = pd.DataFrame([['May1',32],['May2',35],['May3',40],['May4',50]])
print(dict_llst)

print('='*40)

print('Data passed as list of dict')
dict_ldf = pd.DataFrame([{'a': 1, 'b': 2},{'a': 5, 'b': 10}])
print(dict_ldf)

print('='*40)

print('Changing the datatype to float with dtype setter to float')
dict_ldf = pd.DataFrame([{'a': 1, 'b': 2},{'a': 5, 'b': 10}],dtype=float)
print(dict_ldf)

print('='*40)

print('Getting the column names')
print(dict_ldf.columns)

print('='*40)

print('Renaming the column')
dict_ldf.rename(columns={'a':'A','b':'B'},inplace=True)
dict_ldf

Data passed as dictionary
   A  B
0  1  4
1  2  5
2  3  6
========================================
Data pass as list
   0
0  1
1  2
2  3
3  4
========================================
Data passed as list of list
      0   1
0  May1  32
1  May2  35
2  May3  40
3  May4  50
========================================
Data passed as list of dict
   a   b
0  1   2
1  5  10
========================================
Changing the datatype to float with dtype setter to float
     a     b
0  1.0   2.0
1  5.0  10.0
========================================
Getting the column names
Index(['a', 'b'], dtype='object')
========================================
Renaming the column

     A     B
0  1.0   2.0
1  5.0  10.0

#NaN
Column wise NaN<br>
Row wise NaN<br>
Check whether NaN exists<br>
Count how many NaN exists<br>
How to deal with NaN<br>

In [142]:
#In below code, as in second dictionary of a list 'c'column is an extra column which is not in first_dict
#So this is called missing value in first dictionart and hence it will be replaced by NaN
#NaN - Not a number just like infinity which is any indication when the data is not found.




dict_col_nan = pd.DataFrame([{'a': 1, 'b': 2},{'a': 5, 'b': 10,'c':20}])
print(dict_col_nan)

print('='*40)

dict_row_nan = pd.DataFrame({"A": pd.Series([1, 2, 3],dtype = float), "B": pd.Series([4, 5, 6,9],dtype=float)})
print(dict_row_nan)

print('='*40)

print('To check whether dataframe has null values?')
#We use isnull function to check it
print(dict_row_nan.isnull())


#isnull working -- assign each data in the dataframe with True or False
#return dataframe filled with True or False 

#To count how many NaN, use sum function on top of it
print(dict_row_nan.isnull().sum(axis=0))  #---- here axis denotes which dimension you are talking about
                                          #axis = 0, column wise calculation will be displayed, in which column NaN is found and how many (Along the row)
                                          #axis = 1  row wise calculation will be displayed, which row how many NaNs' are found (Along the column)
'''
+------------+---------+--------+
|            |  A      |  B     |
+------------+---------+---------
|      0     | NaN     | 1.52325|----axis=1----->
+------------+---------+--------+
             |         |
             | axis=0  |
             ↓         ↓
'''

print('='*40)

#As in dictionary key becomes column, so if we do not match up the 'columns' with keys it will show the those columns as NaN
dict_ldf = pd.DataFrame([{'a': 1, 'b': 2},{'a': 5, 'b': 10,'c':20}],columns=['A','B','c'])
print(dict_ldf)

print('='*40)

print('Correct column will fill in values')

dict_ldf = pd.DataFrame([{'a': 1, 'b': 2},{'a': 5, 'b': 10,'c':20}],columns=['a','b','c'])
print(dict_ldf)

   a   b     c
0  1   2   NaN
1  5  10  20.0
========================================
     A    B
0  1.0  4.0
1  2.0  5.0
2  3.0  6.0
3  NaN  9.0
========================================
To check whether dataframe has null values?
       A      B
0  False  False
1  False  False
2  False  False
3   True  False
A    1
B    0
dtype: int64
========================================
    A   B     c
0 NaN NaN   NaN
1 NaN NaN  20.0
========================================
Correct column will fill in values
   a   b     c
0  1   2   NaN
1  5  10  20.0

# Column and Indexes

In case of dictionary the keys would act as columns but in lists, the column names if not specified will start as '0'-1st column, '1'-2nd Column and so on
The left most side of the dataframe is called as index, it's starts default with index 0

In [143]:
#Passing customize index --with index varibale

dict_llst = pd.DataFrame([['May1',32],['May2',35],['May3',40],['May4',50]],index = ['Day1','Day2','Day3','Day4'])
print(dict_llst)
print('='*40)

print('Changing column name while defining the dataframe')
dict_llst = pd.DataFrame([['May1',32],['May2',35],['May3',40],['May4',50]],index = ['Day1','Day2','Day3','Day4'],columns = ['May','Temperature'])
print(dict_llst)

print('='*40)

#We can make any column as index
#Here we give the column name which we want to make index as follows

dict_llst = pd.DataFrame([['May1',32],['May2',35],['May3',40],['May4',50]],columns = ['May','Temperature'])
dict_llst.set_index('May')

#We can see even after setting the index as 'May' Column the change did not reflected, this is because, it does not update orginal dataframe
print(dict_llst)

print('='*40)
#Two ways of making the change getting reflected

#Reassign to original dataframe, uncomment the below code

'''

dict_llst = dict_llst.set_index('May')
print(dict_llst)
print('='*40)
'''

#Make use of inplace parameter
dict_llst.set_index('May',inplace=True)
print(dict_llst)

print('='*40)

#To drop index to make back to original sequential form with reset_index method
#Here drop=True means we want to drop the original index we have and reset to default value
dict_llst.reset_index(drop=False,inplace=True)
print(dict_llst)

         0   1
Day1  May1  32
Day2  May2  35
Day3  May3  40
Day4  May4  50
========================================
Changing column name while defining the dataframe
       May  Temperature
Day1  May1           32
Day2  May2           35
Day3  May3           40
Day4  May4           50
========================================
    May  Temperature
0  May1           32
1  May2           35
2  May3           40
3  May4           50
========================================
      Temperature
May
May1           32
May2           35
May3           40
May4           50
========================================
    May  Temperature
0  May1           32
1  May2           35
2  May3           40
3  May4           50

# Manipulation with Data
Accessing<br>
Adding new columns<br>
Adding columns with cool tricks<br>
Deleting columns<br>

In [62]:
df = pd.DataFrame([['May1',32],['May2',35],['May3',40],['May4',50]],index = ['Day1','Day2','Day3','Day4'],columns = ['May','Temperature'])

print('Accessing whole column by its name')
print(df['Temperature'])

print('='*40)

print('Adding Column with and without index see the diff')
add_column = pd.Series(['Charni Rd','Grant Rd','Marine Lines','Churchgate'],index=['Day1','Day2','Day3','Day4'])
df['Stations'] = add_column
print(df)

print('='*40)

print('Use existing Column to create new column')

df['Wind Speed'] = df['Temperature']*0.414
print(df)

print('='*40)

print('Addition of two column, having same dtype')

df['Add_Temp_Wind'] = df['Temperature'] + df['Wind Speed']
print(df)


print('Deleting columns from dataframe')
#Use del function as follows
print('---------Way 1 ---------------')

del df['Add_Temp_Wind']
print(df)

print('---------Way 2 ---------------')

df['Add_Temp_Wind'] = df['Temperature'] + df['Wind Speed']

#use of pop, pass the column name you want to delete 
df.pop('Add_Temp_Wind')
print(df)

print('---------Way 3 ---------------')

df['Add_Temp_Wind'] = df['Temperature'] + df['Wind Speed']

#use drop method, which takes which column(s) to drop and how to
df.drop('Add_Temp_Wind',axis=1,inplace=True)
print(df)

print('='*40)

#Drop row of a dataframe
#use drop function and pass the indexed index or name of that index

#Single index
df.drop(df.index[0])  #inplace=False

#Multiple index
df.drop(df.index[[0,1,2]]) #inplace=False

#By index name
df.drop('Day1',axis=0)
print(df)

Accessing whole column by its name
Day1    32
Day2    35
Day3    40
Day4    50
Name: Temperature, dtype: int64
========================================
Adding Column with and without index see the diff
       May  Temperature      Stations
Day1  May1           32     Charni Rd
Day2  May2           35      Grant Rd
Day3  May3           40  Marine Lines
Day4  May4           50    Churchgate
========================================
Use existing Column to create new column
       May  Temperature      Stations  Wind Speed
Day1  May1           32     Charni Rd      13.248
Day2  May2           35      Grant Rd      14.490
Day3  May3           40  Marine Lines      16.560
Day4  May4           50    Churchgate      20.700
========================================
Addition of two column, having same dtype
       May  Temperature      Stations  Wind Speed  Add_Temp_Wind
Day1  May1           32     Charni Rd      13.248         45.248
Day2  May2           35      Grant Rd      14.490         49.490
Day3  May3           40  Marine Lines      16.560         56.560
Day4  May4           50    Churchgate      20.700         70.700
Deleting columns from dataframe
---------Way 1 ---------------
       May  Temperature      Stations  Wind Speed
Day1  May1           32     Charni Rd      13.248
Day2  May2           35      Grant Rd      14.490
Day3  May3           40  Marine Lines      16.560
Day4  May4           50    Churchgate      20.700
---------Way 2 ---------------
       May  Temperature      Stations  Wind Speed
Day1  May1           32     Charni Rd      13.248
Day2  May2           35      Grant Rd      14.490
Day3  May3           40  Marine Lines      16.560
Day4  May4           50    Churchgate      20.700
---------Way 3 ---------------
       May  Temperature      Stations  Wind Speed
Day1  May1           32     Charni Rd      13.248
Day2  May2           35      Grant Rd      14.490
Day3  May3           40  Marine Lines      16.560
Day4  May4           50    Churchgate      20.700
========================================
       May  Temperature      Stations  Wind Speed
Day1  May1           32     Charni Rd      13.248
Day2  May2           35      Grant Rd      14.490
Day3  May3           40  Marine Lines      16.560
Day4  May4           50    Churchgate      20.700

# Use of loc and iloc

![alt text](http://104.236.88.249/wp-content/uploads/2016/10/Pandas-selections-and-indexing.png)

In [64]:
print(type(df.iloc[1]))
print('='*40)

print('range of index wise selection in discrete manner\n')
print(df.iloc[[1,2,3]])
print('='*40)

print('\nPartial selection column wise and row wise')
print(df.iloc[0:3,0:3])

print('\nComplete row wise and partial column wise')
print(df.iloc[:,0:3])


print('='*40)

print('\nPartial row wise and partial column wise')
print(df.iloc[[1,0,2],:])
print('='*40)

print('\nGet single value')
print(df.iloc[0,0])
print('='*40)

print('\nChanging that value')

df.iloc[0,0] = 'May11'
print(df.iloc[0,0])
print('='*40)

print('\nChanging entire row')
df.iloc[0] = ['May1',35,'Charni Road',15.63]
print(df)

print('*'*90)

<class 'pandas.core.series.Series'>
========================================
range of index wise selection in discrete manner

       May  Temperature      Stations  Wind Speed
Day2  May2           35      Grant Rd       14.49
Day3  May3           40  Marine Lines       16.56
Day4  May4           50    Churchgate       20.70
========================================

Partial selection column wise and row wise
        May  Temperature      Stations
Day1  May11           32     Charni Rd
Day2   May2           35      Grant Rd
Day3   May3           40  Marine Lines

Complete row wise and partial column wise
        May  Temperature      Stations
Day1  May11           32     Charni Rd
Day2   May2           35      Grant Rd
Day3   May3           40  Marine Lines
Day4   May4           50    Churchgate
========================================

Partial row wise and partial column wise
        May  Temperature      Stations  Wind Speed
Day2   May2           35      Grant Rd      14.490
Day1  May11           32     Charni Rd      13.248
Day3   May3           40  Marine Lines      16.560
========================================

Get single value
May11
========================================

Changing that value
May11
========================================

Changing entire row
       May  Temperature      Stations  Wind Speed
Day1  May1           35   Charni Road       15.63
Day2  May2           35      Grant Rd       14.49
Day3  May3           40  Marine Lines       16.56
Day4  May4           50    Churchgate       20.70
******************************************************************************************

In [0]:
#LOC

#loc is label-based, which means that we have to specify the name of the rows and columns that we need to filter out.
#pass columN names and not indexes

#Creating sample DataFrame

import numpy as np

data = pd.DataFrame({
    'age' :     [ 10, 22, 13, 21, 12, 11, 17],
    'section' : [ 'A', 'B', 'C', 'B', 'B', 'A', 'A'],
    'city' :    [ 'Gurgaon', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai'],
    'gender' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'favourite_color' : [ 'red', np.NAN, 'yellow', np.NAN, 'black', 'green', 'red']
})

#Partial column
data.loc[:,['age','section']]

#Partial row
data.loc[0:3,:]

In [140]:

#Condition based filtering

#Syntax ----- data.loc['Condition(s)']
data.loc[data['age'] >= 15]

#Mutiple conditions
data.loc[(data['age'] >= 12) & (data['gender'] == 'M')]

#This condition based filtering is also called as masking
#Syntax mask = (Condtion(s)) --> dataframe[mask]

mask  = (data['age'] >= 15)
data1 = data[mask]
print(data1)

   age section    city gender favourite_color
1   22       B   Delhi      F             NaN
3   21       B   Delhi      M             NaN
6   17       A  Mumbai      F             red

In [0]:
from google.colab import files
import numpy as np
import pandas as pd

# Reading in data as pandas dataframe

In [0]:
files.upload()

In [112]:
#index_col describes which column who want to set the index as
#head function denotes printing first n rows of the dataframe, here n=10 in our case

pokemon_data = pd.read_csv('pokemon_data.csv',index_col = 0)
pokemon_data.head(5)

                    Name Type 1  Type 2  ...  Speed  Generation  Legendary
#                                        ...
1              Bulbasaur  Grass  Poison  ...     45           1      False
2                Ivysaur  Grass  Poison  ...     60           1      False
3               Venusaur  Grass  Poison  ...     80           1      False
3  VenusaurMega Venusaur  Grass  Poison  ...     80           1      False
4             Charmander   Fire     NaN  ...     65           1      False

[5 rows x 11 columns]

In [12]:
#Check the type of each column it will be Series datatype
type(pokemon_data['Name'])

#Can apply head function to indivdual function
pokemon_data['Name'].head(5)

#
1                Bulbasaur
2                  Ivysaur
3                 Venusaur
3    VenusaurMega Venusaur
4               Charmander
Name: Name, dtype: object

In [13]:
#Resettig the index
pokemon_data.reset_index(drop=True,inplace=True)
pokemon_data.head(5)

                    Name Type 1  Type 2  ...  Speed  Generation  Legendary
0              Bulbasaur  Grass  Poison  ...     45           1      False
1                Ivysaur  Grass  Poison  ...     60           1      False
2               Venusaur  Grass  Poison  ...     80           1      False
3  VenusaurMega Venusaur  Grass  Poison  ...     80           1      False
4             Charmander   Fire     NaN  ...     65           1      False

[5 rows x 11 columns]

# Basic Data Retrieval

In [0]:
#Getting Column names
pokemon_data.columns

Index(['Name', 'Type 1', 'Type 2', 'HP', 'Attack', 'Defense', 'Sp. Atk',
       'Sp. Def', 'Speed', 'Generation', 'Legendary'],
      dtype='object')

In [14]:
pokemon_data.iloc[0:5]

                    Name Type 1  Type 2  ...  Speed  Generation  Legendary
0              Bulbasaur  Grass  Poison  ...     45           1      False
1                Ivysaur  Grass  Poison  ...     60           1      False
2               Venusaur  Grass  Poison  ...     80           1      False
3  VenusaurMega Venusaur  Grass  Poison  ...     80           1      False
4             Charmander   Fire     NaN  ...     65           1      False

[5 rows x 11 columns]

In [0]:
#Getting Column names
pokemon_data.columns

#Accessing rows and columns part wise
pokemon_data.iloc[1]
pokemon_data.iloc[0:10]
pokemon_data.iloc[0:10,1:4]
pokemon_data.iloc[:,1:4]

#Accessing particular column the same way as done 
pokemon_data['Type 1'].iloc[0:5]

#Accessing the entire row
pokemon_data.loc[1:10,['Name','Type 1','Type 2']]
pokemon_data.loc[1]

In [0]:
pokemon_data.loc[pokemon_data['Type 1'] == 'Grass',['Name']]
pokemon_data.iloc[(pokemon_data['Type 1'] == 'Grass').values,[0]]

# Knowing the Data Better

In [123]:
#Check the data type of entire dataframe
#Consist information about entire dataframe with use of info function

pokemon_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 800 entries, 1 to 721
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        800 non-null    object
 1   Type 1      800 non-null    object
 2   Type 2      414 non-null    object
 3   HP          800 non-null    int64
 4   Attack      800 non-null    int64
 5   Defense     800 non-null    int64
 6   Sp. Atk     800 non-null    int64
 7   Sp. Def     800 non-null    int64
 8   Speed       800 non-null    int64
 9   Generation  800 non-null    int64
 10  Legendary   800 non-null    bool
dtypes: bool(1), int64(7), object(3)
memory usage: 69.5+ KB

In [15]:
#Note the numeric values will only be calculated and not object or string dtype
#describe function will compute basic statistics as shown below as for each column

pokemon_data.describe()

               HP      Attack     Defense  ...     Sp. Def       Speed  Generation
count  800.000000  800.000000  800.000000  ...  800.000000  800.000000   800.00000
mean    69.258750   79.001250   73.842500  ...   71.902500   68.277500     3.32375
std     25.534669   32.457366   31.183501  ...   27.828916   29.060474     1.66129
min      1.000000    5.000000    5.000000  ...   20.000000    5.000000     1.00000
25%     50.000000   55.000000   50.000000  ...   50.000000   45.000000     2.00000
50%     65.000000   75.000000   70.000000  ...   70.000000   65.000000     3.00000
75%     80.000000  100.000000   90.000000  ...   90.000000   90.000000     5.00000
max    255.000000  190.000000  230.000000  ...  230.000000  180.000000     6.00000

[8 rows x 7 columns]

# Data Cleanup

In [124]:
#Count the NaN values in the dataframe


print(pokemon_data.isnull())


print(pokemon_data.isnull().sum(axis=0))

      Name  Type 1  Type 2     HP  ...  Sp. Def  Speed  Generation  Legendary
#                                  ...
1    False   False   False  False  ...    False  False       False      False
2    False   False   False  False  ...    False  False       False      False
3    False   False   False  False  ...    False  False       False      False
3    False   False   False  False  ...    False  False       False      False
4    False   False    True  False  ...    False  False       False      False
..     ...     ...     ...    ...  ...      ...    ...         ...        ...
719  False   False   False  False  ...    False  False       False      False
719  False   False   False  False  ...    False  False       False      False
720  False   False   False  False  ...    False  False       False      False
720  False   False   False  False  ...    False  False       False      False
721  False   False   False  False  ...    False  False       False      False

[800 rows x 11 columns]
Name            0
Type 1          0
Type 2        386
HP              0
Attack          0
Defense         0
Sp. Atk         0
Sp. Def         0
Speed           0
Generation      0
Legendary       0
dtype: int64

In [134]:
#Dropping NaN with dropna

#axis = 0 drops row 
pokemon_data.dropna(axis=0,inplace=False)

#Masking and use of loc
#Converting to string datatype with astype

pokemon_data['Type 2'] = pokemon_data['Type 2'].astype(str)
mask = (pokemon_data['Type 2'] != 'nan')
pk_data = pokemon_data.loc[mask]
pk_data.head(5)

#Masking concept apply to multiple condition
masking = (pk_data['Type 1'] == 'Grass') & (pk_data['Type 2'] == 'Steel') | (pk_data['Speed'] > 10) 

#so the condition is (Grass) and (Steel) or (Speed > 10)
#So if either all of them are True or Speed > 10 is True or Grass and Steel is True, only those condtioned rows are retained and nothing else
#Can verify for yourself.

#Another way of not using loc and still mask 
pk_data[masking].head(10)

                         Name Type 1  Type 2  ...  Speed  Generation  Legendary
#                                             ...
1                   Bulbasaur  Grass  Poison  ...     45           1      False
2                     Ivysaur  Grass  Poison  ...     60           1      False
3                    Venusaur  Grass  Poison  ...     80           1      False
3       VenusaurMega Venusaur  Grass  Poison  ...     80           1      False
6                   Charizard   Fire  Flying  ...    100           1      False
6   CharizardMega Charizard X   Fire  Dragon  ...    100           1      False
6   CharizardMega Charizard Y   Fire  Flying  ...    100           1      False
12                 Butterfree    Bug  Flying  ...     70           1      False
13                     Weedle    Bug  Poison  ...     50           1      False
14                     Kakuna    Bug  Poison  ...     35           1      False

[10 rows x 11 columns]

#Statistics

In [0]:

pokemon_data['HP'].mean()
pokemon_data['HP'].max()
pokemon_data['HP'].min()
pokemon_data['HP'].std()
pokemon_data['HP'].sum()

In [23]:
#Getting unique values for column 'Type 1'with help of unique function
#The return type is ndarray which consist of n rows an d columns 
#(18,) - Represents 18 rows and 1 column 

pokemon_data['Type 1'].unique()
type(pokemon_data['Type 1'].unique())
pokemon_data['Type 1'].unique().shape

(18,)

In [29]:
#To calculate each category occuring number of times in the column we use function called value_counts
#Return type is series object with index as category and another column as their respective counts

pokemon_data['Type 2'].value_counts().head(10)

#Reset index
pokemon_data['Type 2'].value_counts().reset_index()

#Rename column
pokemon_data['Type 2'].value_counts().reset_index().rename(columns={'index':'Type 2','Type 2':'Counts'}).head(5)

     Type 2  Counts
0    Flying      97
1    Ground      35
2    Poison      34
3   Psychic      33
4  Fighting      26

# Feature Engineering
We use existing data to generate new data to add to the dataframe for more analysis.
This is called as Feature Engineering

In [30]:
import warnings
warnings.filterwarnings('ignore')


#axis = 1 - Denotes the walkthrough will be column wise
#axis = 0 - Denotes the walkthrough will be row wise

#In this case, we are doing it column wise, addition of score from index 3 till 9, 9 is not included and sum it up to store in Total_Attack
pokemon_data['Total_Attack'] = pokemon_data.iloc[:,3:9].sum(axis=1)
pokemon_data.head(5)

                    Name Type 1  Type 2  ...  Generation  Legendary  Total_Attack
0              Bulbasaur  Grass  Poison  ...           1      False           318
1                Ivysaur  Grass  Poison  ...           1      False           405
2               Venusaur  Grass  Poison  ...           1      False           525
3  VenusaurMega Venusaur  Grass  Poison  ...           1      False           625
4             Charmander   Fire     NaN  ...           1      False           309

[5 rows x 12 columns]

Sorting

# Interesting Facts

In [0]:
#Use of copy

#copy function will copy entire data to another variable and if we make some changes in pokemon_data, those changes will be not reflected in another assigned variable

diff_df = pokemon_data.copy()

#Try out some manipuation and check results for both dataframes
same_df = pokemon_data

#Use of Sort
Sorting in programming refers rearranging numeric values in increasing or decreasing order.
So sort_values function does it for us<br>
sort takes in 2 major parameter<br>
sort by which columns<br>
What should be the order of that sorting<br>

For e.g [4,2,5,6,1,2] -> [1,2,2,4,5,6] ascending =True<br>
[4,2,5,6,1,2] -> [6,5,4,2,2,1] ascending = False

In [38]:

#Can assign one column or in more than one column pass it as list
#ascending denotes against each column write the order of execution to sort on
#Return type is dataframe object

diff_df.sort_values(by=['HP','Attack','Defense','Speed'],ascending = [False,True,False,True],inplace=True)
diff_df.head(5)

          Name   Type 1 Type 2   HP  ...  Speed  Generation  Legendary  Total_Attack
261    Blissey   Normal    NaN  255  ...     55           2      False           540
121    Chansey   Normal    NaN  250  ...     50           1      False           450
217  Wobbuffet  Psychic    NaN  190  ...     33           2      False           405
351    Wailord    Water    NaN  170  ...     60           3      False           500
655  Alomomola    Water    NaN  165  ...     65           5      False           470

[5 rows x 12 columns]

In [0]:
#Groupby
#It allows to group the same named data values inside each column you passed to group it
#Again, you can pass multiple columns to perform group by as a list
#The order to execution for group by is starting from indexed 0 till end of the list passed
#Usually group by is used to perform some aggregate analysis on how one column depend on other column

#Assume Basic DataFrame with two columns we wish to group by
#Basic dataframe 
Type2 Type1
a     a1
b     a2
a     a3
d     a1
a     a1
a     a2

#Group by Type 2 then Type 1
Type2   Type1
a       a1
a       a1
a       a2
a       a3
b       a2
d       a1

#Applying aggregate function say mean

Type2   Type1
a       a1    Mean of a1 are calculated for type2 as a
        a2    Mean of a1 are calculated
        a3    Mean of a2 are calculated
b       a2    Mean of a2 are calculated for type2 as b
d       a1    Mean of a1 are calculated for type2 as d

In [39]:
#Normal Group by
pokemon_data.groupby(['Type 2','Type 1']).head(5)

#Group by with Aggregate Function
pokemon_data.groupby(['Type 2','Type 1']).mean().head(5)

                        HP  Attack  ...  Legendary  Total_Attack
Type 2 Type 1                       ...
Bug    Poison    40.000000    50.0  ...        0.0    330.000000
       Rock      60.000000   110.0  ...        0.0    425.000000
Dark   Fighting  95.000000   124.0  ...        0.0    495.000000
       Ghost     50.000000    92.0  ...        0.0    485.000000
       Grass     76.666667    95.0  ...        0.0    431.666667

[5 rows x 9 columns]

#Small Problem for practice
Say you are the data scientist and your are being told 
Get me for each type 2, strongest pokemon you want to get into battle field

In [0]:
def strongestPokemon():
  strongPokemon_df = pd.DataFrame()
  each_type_df = []
  
  for type2 in pk_data['Type 2'].unique():
      sub_type = pk_data[pk_data['Type 2'] == type2]
      sub_type.sort_values(by=['HP','Attack','Defense','Speed'],ascending=[False,False,False,False],inplace=True)
      sub_type.reset_index(drop=True,inplace=True)
      top_pokemon = sub_type.loc[1]
      each_type_df.append(top_pokemon)

  strongPokemon_df = pd.DataFrame(each_type_df,columns=pk_data.columns)

  return strongPokemon_df

pk_strongest = strongestPokemon()